frontend/controllers/PagesController.php

    public function actionOne($url)
    {

        // Переменные и настройки для текстов всех страниц сайта

        if (!Yii::$app->request->get('date')){

            $calculationDate = WomanCalculators::todayDate('0');

        } else {

            $calculationDate = Yii::$app->request->get('date');

        }
        $currentLanguages = Pages::currentLanguages();
        $allPages = Pages::allPages();
        $allPagesTranslations = Pages::allPagesTranslations($currentLanguages->id);
        $pages = Pages::find()->andWhere(['url' => $url])->one();
---
SELECT * FROM `pages` WHERE `url`='pregnancy-calculator'